# Exploration of Translated Items

> The purpose of this exploration is to get a grasp of what the translated data sets in the GitHub repo look like and how they could be of use for the task of NER or relation extraction.

In [19]:
# library for working with paths
import pathlib
# data manipulation library
import pandas as pd 
# lists directory items into list objects
from glob import glob

In [23]:
# set the path for where the data is
data_path = pathlib.Path().cwd() / 'data/*.csv'

In [26]:
# iterate through the items in the path and save in a list of dfs
dfs = [pd.read_csv(path) for path in glob(str(data_path))]

In [28]:
dfs[0].head()

,id,name,description,menus_appeared,times_appeared,first_appeared,last_appeared,lowest_price,highest_price,seafood_yn,translatedText
0,1,Consomme printaniere royal,NaN,8,8,1897,1927,0.20,0.4,0,Royal Spring Consume
1,5,St. Emilion,NaN,66,68,1881,1981,0.00,18.0,0,St. Emilion
2,16,Pim-olas,NaN,145,148,1897,1918,0.15,35.0,0,Pim-waves
3,23,Pomard,NaN,11,11,1880,1950,0.75,5.0,0,Pomard
4,29,G. H. Mumm & Co's Extra Dry,NaN,14,14,1895,1914,2.00,4.0,0,G. H. Mumm & Co's Extra Dry

In [29]:
dfs[1].head()

,id,name,description,menus_appeared,times_appeared,first_appeared,last_appeared,lowest_price,highest_price,seafood_yn,translatedText
0,2,Chicken gumbo,NaN,111,117,1895,1960,0.10,0.8,0,Chicken gumbo
1,3,Tomato aux croutons,NaN,13,13,1893,1917,0.25,0.4,0,Tomato with croutons
2,4,Onion au gratin,NaN,41,41,1900,1971,0.25,1.0,0,Onion au gratin
3,7,Radishes,NaN,3262,3346,1854,2928,0.00,25.0,0,Radishes
4,8,Chicken soup with rice,NaN,48,49,1897,1961,0.10,0.6,0,Chicken soup with rice

In [30]:
dfs[2].head()

,id,name,description,menus_appeared,times_appeared,first_appeared,last_appeared,lowest_price,highest_price,seafood_yn,translatedText
0,1,Consomme printaniere royal,NaN,8,8,1897,1927,0.20,0.4,0,Royal Spring Consume
1,5,St. Emilion,NaN,66,68,1881,1981,0.00,18.0,0,St. Emilion
2,16,Pim-olas,NaN,145,148,1897,1918,0.15,35.0,0,Pim-waves
3,23,Pomard,NaN,11,11,1880,1950,0.75,5.0,0,Pomard
4,29,G. H. Mumm & Co's Extra Dry,NaN,14,14,1895,1914,2.00,4.0,0,G. H. Mumm & Co's Extra Dry

In [32]:
dfs[0].description.unique()

array([nan])

## Conclusion

It doesn't look like these data are going to be useful for the NER or relation extraction use-cases.  We're probably going to need more text for the modeling to work properly.  These data could be useful for future translation matching.